MCUdude/MiniCore/avr/boards.txt
# Variants
168.menu.variant.modelP=168P / 168PA
168.menu.variant.modelP.bootloader.cksel_bits=0111
168.menu.variant.modelP.build.variant=standard
168.menu.variant.modelP.build.mcu=atmega168p

168.menu.variant.modelNonP=168 / 168A
168.menu.variant.modelNonP.bootloader.cksel_bits=0111
168.menu.variant.modelNonP.build.variant=standard
168.menu.variant.modelNonP.build.mcu=atmega168

168.menu.variant.modelPB=168PB
168.menu.variant.modelPB.bootloader.cksel_bits=1111
168.menu.variant.modelPB.build.variant=pb-variant
168.menu.variant.modelPB.build.mcu=atmega168pb

# Brown out detection
168.menu.BOD.2v7=BOD 2.7V
168.menu.BOD.2v7.bootloader.high_fuses=0b1101{bootloader.eesave_bit}101
168.menu.BOD.4v3=BOD 4.3V
168.menu.BOD.4v3.bootloader.high_fuses=0b1101{bootloader.eesave_bit}100
168.menu.BOD.1v8=BOD 1.8V
168.menu.BOD.1v8.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
168.menu.BOD.disabled=BOD disabled
168.menu.BOD.disabled.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111

# Compiler link time optimization
168.menu.LTO.Os=LTO Disabled
168.menu.LTO.Os.compiler.c.extra_flags=
168.menu.LTO.Os.compiler.c.elf.extra_flags=
168.menu.LTO.Os.compiler.cpp.extra_flags=
168.menu.LTO.Os.ltoarcmd=avr-ar

168.menu.LTO.Os_flto=LTO Enabled
168.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
168.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
168.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
168.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
168.menu.clock.16MHz_external=External 16 MHz
168.menu.clock.16MHz_external.upload.speed=115200
168.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.16MHz_external.build.clkpr=
168.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.16MHz_external.build.f_cpu=16000000L

168.menu.clock.20MHz_external=External 20 MHz
168.menu.clock.20MHz_external.upload.speed=115200
168.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.20MHz_external.build.clkpr=
168.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.20MHz_external.build.f_cpu=20000000L

168.menu.clock.18_432MHz_external=External 18.432 MHz
168.menu.clock.18_432MHz_external.upload.speed=115200
168.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.18_432MHz_external.build.clkpr=
168.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.18_432MHz_external.build.f_cpu=18432000L

168.menu.clock.14_7456MHz_external=External 14.7456 MHz
168.menu.clock.14_7456MHz_external.upload.speed=115200
168.menu.clock.14_7456MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.14_7456MHz_external.build.clkpr=
168.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

168.menu.clock.12MHz_external=External 12 MHz
168.menu.clock.12MHz_external.upload.speed=57600
168.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.12MHz_external.build.clkpr=
168.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.12MHz_external.build.f_cpu=12000000L

168.menu.clock.11_0592MHz_external=External 11.0592 MHz
168.menu.clock.11_0592MHz_external.upload.speed=115200
168.menu.clock.11_0592MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.11_0592MHz_external.build.clkpr=
168.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

168.menu.clock.8MHz_external=External 8 MHz
168.menu.clock.8MHz_external.upload.speed=57600
168.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.8MHz_external.build.clkpr=
168.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.8MHz_external.build.f_cpu=8000000L

168.menu.clock.7_3728MHz_external=External 7.3728 MHz
168.menu.clock.7_3728MHz_external.upload.speed=115200
168.menu.clock.7_3728MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.7_3728MHz_external.build.clkpr=
168.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

168.menu.clock.4MHz_external=External 4 MHz
168.menu.clock.4MHz_external.upload.speed=9600
168.menu.clock.4MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.4MHz_external.build.clkpr=
168.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.4MHz_external.build.f_cpu=4000000L

168.menu.clock.3_6864MHz_external=External 3.6864 MHz
168.menu.clock.3_6864MHz_external.upload.speed=115200
168.menu.clock.3_6864MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.3_6864MHz_external.build.clkpr=
168.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

168.menu.clock.2MHz_external=External 2 MHz
168.menu.clock.2MHz_external.upload.speed=9600
168.menu.clock.2MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.2MHz_external.build.clkpr=
168.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.2MHz_external.build.f_cpu=2000000L

168.menu.clock.1_8432MHz_external=External 1.8432 MHz
168.menu.clock.1_8432MHz_external.upload.speed=115200
168.menu.clock.1_8432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.1_8432MHz_external.build.clkpr=
168.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

168.menu.clock.1MHz_external=External 1 MHz
168.menu.clock.1MHz_external.upload.speed=9600
168.menu.clock.1MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.1MHz_external.build.clkpr=
168.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
168.menu.clock.1MHz_external.build.f_cpu=1000000L

168.menu.clock.8MHz_internal=Internal 8 MHz
168.menu.clock.8MHz_internal.upload.speed=38400
168.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
168.menu.clock.8MHz_internal.build.clkpr=
168.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
168.menu.clock.8MHz_internal.build.f_cpu=8000000L

